app/controllers/tasks_controller.rb

  def index
    new
    @tasks = Task.all
---
SELECT * FROM "tasks"